{
  "comment": "U.S. economic indicators from Federal Reserve (FRED), Bureau of Labor Statistics (BLS), Bureau of Economic Analysis (BEA), and Treasury Department. Includes employment statistics, inflation metrics, GDP components, interest rates, regional economic data, and over 800,000 time series from FRED. Enables macroeconomic analysis, economic forecasting, policy research, and cross-domain correlation with geographic and demographic data.",
  "partitionedTables": [
    {
      "name": "employment_statistics",
      "pattern": "type=indicators/year=*/employment_statistics.parquet",
      "comment": "U.S. employment and unemployment statistics from BLS including national unemployment rate, labor force participation, job openings, and employment by sector. Updated monthly with seasonal adjustments."
    },
    {
      "name": "inflation_metrics",
      "pattern": "type=indicators/year=*/inflation_metrics.parquet",
      "comment": "Consumer Price Index (CPI) and Producer Price Index (PPI) data tracking inflation across different categories of goods and services. Includes urban, regional, and sector-specific inflation rates."
    },
    {
      "name": "regional_cpi",
      "pattern": "type=cpi_regional/year=*/regional_cpi.parquet",
      "comment": "Consumer Price Index for 4 U.S. Census regions (Northeast, Midwest, South, West). Enables regional inflation comparisons and analysis of cost-of-living differences across major geographic areas."
    },
    {
      "name": "metro_cpi",
      "pattern": "type=cpi_metro/year=*/metro_cpi.parquet",
      "comment": "Consumer Price Index for 27 major U.S. metropolitan areas including NYC, LA, Chicago, Houston, Phoenix, and others. Critical for understanding local cost-of-living variations and metro-specific inflation trends."
    },
    {
      "name": "state_industry",
      "pattern": "type=state_industry/year=*/state_industry.parquet",
      "comment": "Employment by industry sector for all 51 U.S. jurisdictions (50 states + DC) across 22 NAICS supersector codes. Includes total nonfarm employment, private sector employment, and breakdowns by major industry categories like manufacturing, construction, retail, healthcare, and government. Enables state-level industry analysis and cross-state economic comparisons."
    },
    {
      "name": "state_wages",
      "pattern": "type=state_wages/year=*/state_wages.parquet",
      "comment": "Average weekly wages for all 51 U.S. jurisdictions (50 states + DC) from BLS QCEW (Quarterly Census of Employment and Wages). Provides state-level compensation data for understanding regional wage differences, cost-of-living adjustments, and economic competitiveness analysis."
    },
    {
      "name": "metro_industry",
      "pattern": "type=metro_industry/year=*/metro_industry.parquet",
      "comment": "Employment by industry sector for 27 major U.S. metropolitan areas across 22 NAICS supersector codes. Covers major metros including NYC, LA, Chicago, Houston, and others with detailed industry breakdowns for manufacturing, retail, healthcare, financial activities, and government sectors. Enables metro-level industry analysis and cross-metro economic comparisons."
    },
    {
      "name": "metro_wages",
      "pattern": "type=metro_wages/year=*/metro_wages.parquet",
      "comment": "Average weekly wages for 27 major U.S. metropolitan areas from BLS QCEW (Quarterly Census of Employment and Wages). Provides metro-level compensation data for understanding local wage differences, cost-of-living adjustments, and metropolitan economic competitiveness analysis."
    },
    {
      "name": "county_qcew",
      "pattern": "type=county_qcew/year=*/county_qcew.parquet",
      "comment": "County-level employment and wages from BLS QCEW (Quarterly Census of Employment and Wages) for all ~3,142 U.S. counties. Comprehensive data includes establishment counts, employment levels, total wages, and average weekly wages by industry (NAICS codes) and ownership type (private, federal, state, local government). Enables detailed county-level labor market analysis, industry concentration studies, and regional economic development research."
    },
    {
      "name": "jolts_regional",
      "pattern": "type=jolts_regional/year=*/jolts_regional.parquet",
      "comment": "Job Openings and Labor Turnover Survey (JOLTS) data for 4 U.S. Census regions (Northeast, Midwest, South, West). Tracks job openings rate, hires rate, total separations rate, quits rate, and layoffs/discharges rate. Provides critical insights into labor market dynamics, worker mobility, and regional employment trends."
    },
    {
      "name": "wage_growth",
      "pattern": "type=indicators/year=*/wage_growth.parquet",
      "comment": "Average hourly earnings, weekly earnings, and employment cost index by industry and occupation. Tracks wage growth trends and labor cost pressures."
    },
    {
      "name": "regional_employment",
      "pattern": "type=regional/year=*/regional_employment.parquet",
      "comment": "State and metropolitan area employment statistics including unemployment rates, job growth, and labor force participation by geographic region."
    },
    {
      "name": "treasury_yields",
      "pattern": "type=timeseries/year=*/treasury_yields.parquet",
      "comment": "Daily U.S. Treasury yield curve rates from 1-month to 30-year maturities. Includes nominal yields, TIPS yields, and yield curve shape indicators. Source: U.S. Treasury Direct API."
    },
    {
      "name": "federal_debt",
      "pattern": "type=timeseries/year=*/federal_debt.parquet",
      "comment": "U.S. federal debt statistics including total public debt, debt held by public, and intragovernmental holdings. Tracks debt levels, composition, and trends. Source: Treasury Fiscal Data API."
    },
    {
      "name": "world_indicators",
      "pattern": "type=indicators/year=*/world_indicators.parquet",
      "comment": "International economic indicators from World Bank for major economies. Includes GDP, inflation, unemployment, government debt, and population statistics. Enables comparison of U.S. economic performance with global peers."
    },
    {
      "name": "fred_indicators",
      "pattern": "type=indicators/year=*/fred_indicators.parquet",
      "comment": "Federal Reserve Economic Data (FRED) time series including GDP, interest rates, monetary aggregates, and other key economic indicators."
    },
    {
      "name": "gdp_components",
      "pattern": "type=indicators/year=*/gdp_components.parquet",
      "comment": "Detailed GDP components from BEA including consumption, investment, government spending, and net exports broken down by subcategories."
    },
    {
      "name": "gdp_statistics",
      "pattern": "type=indicators/year=*/gdp_statistics.parquet",
      "comment": "Quarterly and annual GDP growth rates, nominal and real GDP values."
    },
    {
      "name": "regional_income",
      "pattern": "type=indicators/year=*/regional_income.parquet",
      "comment": "State and regional personal income statistics from BEA Regional Economic Accounts. Includes total income, per capita income, and population by state."
    },
    {
      "name": "state_gdp",
      "pattern": "type=indicators/year=*/state_gdp.parquet",
      "comment": "State-level GDP statistics from BEA Regional Economic Accounts (SAGDP2N table). Provides both total GDP and per capita real GDP by state across all NAICS industry sectors."
    },
    {
      "name": "trade_statistics",
      "pattern": "type=indicators/year=*/trade_statistics.parquet",
      "comment": "Detailed U.S. export and import statistics from BEA NIPA Table T40205B. Comprehensive breakdown of goods and services trade by category with calculated trade balances."
    },
    {
      "name": "ita_data",
      "pattern": "type=indicators/year=*/ita_data.parquet",
      "comment": "International Transactions Accounts (ITA) from BEA providing balance of payments statistics. Includes trade balance, current account, capital account, and income balances."
    },
    {
      "name": "industry_gdp",
      "pattern": "type=indicators/year=*/industry_gdp.parquet",
      "comment": "GDP by Industry data from BEA showing value added by NAICS industry sectors. Provides comprehensive breakdown of economic output by industry including agriculture, mining, manufacturing, services, and government sectors. Available at both annual and quarterly frequencies for detailed sectoral analysis."
    },
    {
      "name": "fred_data_series_catalog",
      "pattern": "type=catalog/category=*/frequency=*/source=*/status=*/fred_data_series_catalog.parquet",
      "comment": "Complete FRED economic data series catalog with 841,000+ series partitioned by category/frequency/source/status. Status partition separates 'active' (currently updated) from 'discontinued' (no longer updated) series. Includes series metadata, categories, descriptions, units, frequency, and search capabilities. Enables efficient querying for either current data or historical analysis with partitions for major economic categories (national_accounts, labor_markets, finance, prices, etc.). Updated daily from FRED API with comprehensive coverage of all available economic time series for discovery and programmatic access."
    }
  ],
  "constraints": {
    "employment_statistics": {
      "primaryKey": ["date", "series_id"],
      "foreignKeys": [
        {
          "columns": ["series_id"],
          "targetSchema": "econ",
          "targetTable": "fred_indicators",
          "targetColumns": ["series_id"]
        }
      ]
    },
    "inflation_metrics": {
      "primaryKey": ["date", "index_type", "item_code", "area_code"],
      "foreignKeys": [
        {
          "columns": ["area_code"],
          "targetSchema": "econ",
          "targetTable": "regional_employment",
          "targetColumns": ["area_code"]
        }
      ]
    },
    "regional_cpi": {
      "primaryKey": ["date", "region_code"]
    },
    "metro_cpi": {
      "primaryKey": ["date", "metro_area_code"]
    },
    "state_industry": {
      "primaryKey": ["date", "state_fips", "supersector_code"],
      "foreignKeys": [
        {
          "columns": ["state_fips"],
          "targetSchema": "geo",
          "targetTable": "states",
          "targetColumns": ["state_fips"],
          "comment": "Links state industry employment to geographic and demographic data for state-level analysis"
        }
      ]
    },
    "state_wages": {
      "primaryKey": ["date", "state_fips"],
      "foreignKeys": [
        {
          "columns": ["state_fips"],
          "targetSchema": "geo",
          "targetTable": "states",
          "targetColumns": ["state_fips"],
          "comment": "Links state wage data to geographic and demographic data for regional compensation analysis"
        }
      ]
    },
    "metro_industry": {
      "primaryKey": ["date", "metro_area_code", "supersector_code"]
    },
    "metro_wages": {
      "primaryKey": ["date", "metro_area_code"]
    },
    "jolts_regional": {
      "primaryKey": ["date", "region_code", "metric"]
    },
    "wage_growth": {
      "primaryKey": ["date", "series_id", "industry_code", "occupation_code"]
    },
    "regional_employment": {
      "primaryKey": ["date", "area_code"],
      "foreignKeys": [
        {
          "columns": ["area_code"],
          "targetSchema": "geo",
          "targetTable": "states",
          "targetColumns": ["state_fips"],
          "comment": "Links regional employment to state geography when area_code represents state-level data (state FIPS codes)"
        }
      ]
    },
    "treasury_yields": {
      "primaryKey": ["date", "maturity_months"]
    },
    "federal_debt": {
      "primaryKey": ["date", "debt_type"]
    },
    "world_indicators": {
      "primaryKey": ["country_code", "indicator_code", "year"]
    },
    "fred_indicators": {
      "primaryKey": ["series_id", "date"]
    },
    "gdp_components": {
      "primaryKey": ["table_id", "line_number", "year"],
      "foreignKeys": [
        {
          "columns": ["table_id"],
          "targetSchema": "econ",
          "targetTable": "fred_indicators",
          "targetColumns": ["series_id"]
        }
      ]
    },
    "gdp_statistics": {
      "primaryKey": ["year", "quarter", "metric"]
    },
    "regional_income": {
      "primaryKey": ["geo_fips", "metric", "year"],
      "foreignKeys": [
        {
          "columns": ["geo_fips"],
          "targetSchema": "geo",
          "targetTable": "states",
          "targetColumns": ["state_fips"],
          "comment": "Links regional income to state geography for spatial analysis and demographic correlation (when geo_fips is state-level)"
        }
      ]
    },
    "state_gdp": {
      "primaryKey": ["geo_fips", "line_code", "year"],
      "foreignKeys": [
        {
          "columns": ["geo_fips"],
          "targetSchema": "geo",
          "targetTable": "states",
          "targetColumns": ["state_fips"],
          "comment": "Links state GDP to geographic and demographic data for per capita analysis and regional economic comparisons"
        }
      ]
    },
    "trade_statistics": {
      "primaryKey": ["year", "quarter", "category"]
    },
    "ita_data": {
      "primaryKey": ["year", "quarter", "account_type"]
    },
    "industry_gdp": {
      "primaryKey": ["industry_code", "year", "quarter"]
    },
    "fred_data_series_catalog": {
      "primaryKey": ["series_id"],
      "indexes": [
        ["title"],
        ["category_id"],
        ["units"],
        ["frequency"],
        ["seasonal_adjustment"],
        ["source_name"]
      ]
    }
  }
}
